zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_adc.h
/** @defgroup ADC_Error_Code ADC Error Code
  * @{
  */
#define HAL_ADC_ERROR_NONE              (0x00U)   /*!< No error                                    */
#define HAL_ADC_ERROR_INTERNAL          (0x01U)   /*!< ADC peripheral internal error (problem of clocking,
                                                       enable/disable, erroneous state, ...)       */
#define HAL_ADC_ERROR_OVR               (0x02U)   /*!< Overrun error                               */
#define HAL_ADC_ERROR_DMA               (0x04U)   /*!< DMA transfer error                          */
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
#define HAL_ADC_ERROR_INVALID_CALLBACK  (0x10U)   /*!< Invalid Callback error */
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup ADC_HAL_EC_COMMON_CLOCK_SOURCE  ADC common - Clock source
  * @{
  */
#define ADC_CLOCK_CK_ICN_LS_MCU_DIV1              (LL_ADC_CLOCK_CK_ICN_LS_CSU | LL_ADC_CLOCK_DIV1)      /*!< ADC CK_ICN_LS_MCU clock without prescaler              */
#define ADC_CLOCK_CK_ICN_LS_MCU_DIV2              (LL_ADC_CLOCK_CK_ICN_LS_CSU | LL_ADC_CLOCK_DIV2)      /*!< ADC CK_ICN_LS_MCU clock with prescaler division by 2   */
#define ADC_CLOCK_CK_ICN_LS_MCU_DIV4              (LL_ADC_CLOCK_CK_ICN_LS_CSU | LL_ADC_CLOCK_DIV4)      /*!< ADC CK_ICN_LS_MCU clock with prescaler division by 4   */
#define ADC_CLOCK_CK_ICN_LS_MCU_DIV6              (LL_ADC_CLOCK_CK_ICN_LS_CSU | LL_ADC_CLOCK_DIV6)      /*!< ADC CK_ICN_LS_MCU clock with prescaler division by 6   */
#define ADC_CLOCK_CK_ICN_LS_MCU_DIV8              (LL_ADC_CLOCK_CK_ICN_LS_CSU | LL_ADC_CLOCK_DIV8)      /*!< ADC CK_ICN_LS_MCU clock with prescaler division by 8   */
#define ADC_CLOCK_CK_ICN_LS_MCU_DIV10             (LL_ADC_CLOCK_CK_ICN_LS_CSU | LL_ADC_CLOCK_DIV10)     /*!< ADC CK_ICN_LS_MCU clock with prescaler division by 10  */
#define ADC_CLOCK_CK_ICN_LS_MCU_DIV12             (LL_ADC_CLOCK_CK_ICN_LS_CSU | LL_ADC_CLOCK_DIV12)     /*!< ADC CK_ICN_LS_MCU clock with prescaler division by 12  */
#define ADC_CLOCK_CK_ICN_LS_MCU_DIV16             (LL_ADC_CLOCK_CK_ICN_LS_CSU | LL_ADC_CLOCK_DIV16)     /*!< ADC CK_ICN_LS_MCU clock with prescaler division by 16  */
#define ADC_CLOCK_CK_ICN_LS_MCU_DIV32             (LL_ADC_CLOCK_CK_ICN_LS_CSU | LL_ADC_CLOCK_DIV32)     /*!< ADC CK_ICN_LS_MCU clock with prescaler division by 32  */
#define ADC_CLOCK_CK_ICN_LS_MCU_DIV64             (LL_ADC_CLOCK_CK_ICN_LS_CSU | LL_ADC_CLOCK_DIV64)     /*!< ADC CK_ICN_LS_MCU clock with prescaler division by 64  */
#define ADC_CLOCK_CK_ICN_LS_MCU_DIV128            (LL_ADC_CLOCK_CK_ICN_LS_CSU | LL_ADC_CLOCK_DIV128)    /*!< ADC CK_ICN_LS_MCU clock with prescaler division by 128 */
#define ADC_CLOCK_CK_ICN_LS_MCU_DIV256            (LL_ADC_CLOCK_CK_ICN_LS_CSU | LL_ADC_CLOCK_DIV256)    /*!< ADC CK_ICN_LS_MCU clock with prescaler division by 256 */
#if defined(ADC12_COMMON)
#define ADC_CLOCK_CK_KER_ADC12_DIV1               (LL_ADC_CLOCK_KER_ADC12     | LL_ADC_CLOCK_DIV1)      /*!< ADC CK_KER_ADC12 clock without prescaler               */
#define ADC_CLOCK_CK_KER_ADC12_DIV2               (LL_ADC_CLOCK_KER_ADC12     | LL_ADC_CLOCK_DIV2)      /*!< ADC CK_KER_ADC12 clock with prescaler division by 2    */
#define ADC_CLOCK_CK_KER_ADC12_DIV4               (LL_ADC_CLOCK_KER_ADC12     | LL_ADC_CLOCK_DIV4)      /*!< ADC CK_KER_ADC12 clock with prescaler division by 4    */
#define ADC_CLOCK_CK_KER_ADC12_DIV6               (LL_ADC_CLOCK_KER_ADC12     | LL_ADC_CLOCK_DIV6)      /*!< ADC CK_KER_ADC12 clock with prescaler division by 6    */
#define ADC_CLOCK_CK_KER_ADC12_DIV8               (LL_ADC_CLOCK_KER_ADC12     | LL_ADC_CLOCK_DIV8)      /*!< ADC CK_KER_ADC12 clock with prescaler division by 8    */
#define ADC_CLOCK_CK_KER_ADC12_DIV10              (LL_ADC_CLOCK_KER_ADC12     | LL_ADC_CLOCK_DIV10)     /*!< ADC CK_KER_ADC12 clock with prescaler division by 10   */
#define ADC_CLOCK_CK_KER_ADC12_DIV12              (LL_ADC_CLOCK_KER_ADC12     | LL_ADC_CLOCK_DIV12)     /*!< ADC CK_KER_ADC12 clock with prescaler division by 12   */
#define ADC_CLOCK_CK_KER_ADC12_DIV16              (LL_ADC_CLOCK_KER_ADC12     | LL_ADC_CLOCK_DIV16)     /*!< ADC CK_KER_ADC12 clock with prescaler division by 16   */
#define ADC_CLOCK_CK_KER_ADC12_DIV32              (LL_ADC_CLOCK_KER_ADC12     | LL_ADC_CLOCK_DIV32)     /*!< ADC CK_KER_ADC12 clock with prescaler division by 32   */
#define ADC_CLOCK_CK_KER_ADC12_DIV64              (LL_ADC_CLOCK_KER_ADC12     | LL_ADC_CLOCK_DIV64)     /*!< ADC CK_KER_ADC12 clock with prescaler division by 64   */
#define ADC_CLOCK_CK_KER_ADC12_DIV128             (LL_ADC_CLOCK_KER_ADC12     | LL_ADC_CLOCK_DIV128)    /*!< ADC CK_KER_ADC12 clock with prescaler division by 128  */
#define ADC_CLOCK_CK_KER_ADC12_DIV256             (LL_ADC_CLOCK_KER_ADC12     | LL_ADC_CLOCK_DIV256)    /*!< ADC CK_KER_ADC12 clock with prescaler division by 256  */
#endif /* ADC12_COMMON */
#if defined(ADC1_COMMON)
#define ADC_CLOCK_CK_KER_ADC1_DIV1                (LL_ADC_CLOCK_KER_ADC1      | LL_ADC_CLOCK_DIV1)      /*!< ADC CK_KER_ADC3 clock without prescaler                */
#define ADC_CLOCK_CK_KER_ADC1_DIV2                (LL_ADC_CLOCK_KER_ADC1      | LL_ADC_CLOCK_DIV2)      /*!< ADC CK_KER_ADC3 clock with prescaler division by 2     */
#define ADC_CLOCK_CK_KER_ADC1_DIV4                (LL_ADC_CLOCK_KER_ADC1      | LL_ADC_CLOCK_DIV4)      /*!< ADC CK_KER_ADC3 clock with prescaler division by 4     */
#define ADC_CLOCK_CK_KER_ADC1_DIV6                (LL_ADC_CLOCK_KER_ADC1      | LL_ADC_CLOCK_DIV6)      /*!< ADC CK_KER_ADC3 clock with prescaler division by 6     */
#define ADC_CLOCK_CK_KER_ADC1_DIV8                (LL_ADC_CLOCK_KER_ADC1      | LL_ADC_CLOCK_DIV8)      /*!< ADC CK_KER_ADC3 clock with prescaler division by 8     */
#define ADC_CLOCK_CK_KER_ADC1_DIV10               (LL_ADC_CLOCK_KER_ADC1      | LL_ADC_CLOCK_DIV10)     /*!< ADC CK_KER_ADC3 clock with prescaler division by 10    */
#define ADC_CLOCK_CK_KER_ADC1_DIV12               (LL_ADC_CLOCK_KER_ADC1      | LL_ADC_CLOCK_DIV12)     /*!< ADC CK_KER_ADC3 clock with prescaler division by 12    */
#define ADC_CLOCK_CK_KER_ADC1_DIV16               (LL_ADC_CLOCK_KER_ADC1      | LL_ADC_CLOCK_DIV16)     /*!< ADC CK_KER_ADC3 clock with prescaler division by 16    */
#define ADC_CLOCK_CK_KER_ADC1_DIV32               (LL_ADC_CLOCK_KER_ADC1      | LL_ADC_CLOCK_DIV32)     /*!< ADC CK_KER_ADC3 clock with prescaler division by 32    */
#define ADC_CLOCK_CK_KER_ADC1_DIV64               (LL_ADC_CLOCK_KER_ADC1      | LL_ADC_CLOCK_DIV64)     /*!< ADC CK_KER_ADC3 clock with prescaler division by 64    */
#define ADC_CLOCK_CK_KER_ADC1_DIV128              (LL_ADC_CLOCK_KER_ADC1      | LL_ADC_CLOCK_DIV128)    /*!< ADC CK_KER_ADC3 clock with prescaler division by 128   */
#define ADC_CLOCK_CK_KER_ADC1_DIV256              (LL_ADC_CLOCK_KER_ADC1      | LL_ADC_CLOCK_DIV256)    /*!< ADC CK_KER_ADC3 clock with prescaler division by 256   */
#endif /* ADC1_COMMON */
#if defined(ADC2_COMMON)
#define ADC_CLOCK_CK_KER_ADC2_DIV1                (LL_ADC_CLOCK_KER_ADC2      | LL_ADC_CLOCK_DIV1)      /*!< ADC CK_KER_ADC3 clock without prescaler                */
#define ADC_CLOCK_CK_KER_ADC2_DIV2                (LL_ADC_CLOCK_KER_ADC2      | LL_ADC_CLOCK_DIV2)      /*!< ADC CK_KER_ADC3 clock with prescaler division by 2     */
#define ADC_CLOCK_CK_KER_ADC2_DIV4                (LL_ADC_CLOCK_KER_ADC2      | LL_ADC_CLOCK_DIV4)      /*!< ADC CK_KER_ADC3 clock with prescaler division by 4     */
#define ADC_CLOCK_CK_KER_ADC2_DIV6                (LL_ADC_CLOCK_KER_ADC2      | LL_ADC_CLOCK_DIV6)      /*!< ADC CK_KER_ADC3 clock with prescaler division by 6     */
#define ADC_CLOCK_CK_KER_ADC2_DIV8                (LL_ADC_CLOCK_KER_ADC2      | LL_ADC_CLOCK_DIV8)      /*!< ADC CK_KER_ADC3 clock with prescaler division by 8     */
#define ADC_CLOCK_CK_KER_ADC2_DIV10               (LL_ADC_CLOCK_KER_ADC2      | LL_ADC_CLOCK_DIV10)     /*!< ADC CK_KER_ADC3 clock with prescaler division by 10    */
#define ADC_CLOCK_CK_KER_ADC2_DIV12               (LL_ADC_CLOCK_KER_ADC2      | LL_ADC_CLOCK_DIV12)     /*!< ADC CK_KER_ADC3 clock with prescaler division by 12    */
#define ADC_CLOCK_CK_KER_ADC2_DIV16               (LL_ADC_CLOCK_KER_ADC2      | LL_ADC_CLOCK_DIV16)     /*!< ADC CK_KER_ADC3 clock with prescaler division by 16    */
#define ADC_CLOCK_CK_KER_ADC2_DIV32               (LL_ADC_CLOCK_KER_ADC2      | LL_ADC_CLOCK_DIV32)     /*!< ADC CK_KER_ADC3 clock with prescaler division by 32    */
#define ADC_CLOCK_CK_KER_ADC2_DIV64               (LL_ADC_CLOCK_KER_ADC2      | LL_ADC_CLOCK_DIV64)     /*!< ADC CK_KER_ADC3 clock with prescaler division by 64    */
#define ADC_CLOCK_CK_KER_ADC2_DIV128              (LL_ADC_CLOCK_KER_ADC2      | LL_ADC_CLOCK_DIV128)    /*!< ADC CK_KER_ADC3 clock with prescaler division by 128   */
#define ADC_CLOCK_CK_KER_ADC2_DIV256              (LL_ADC_CLOCK_KER_ADC2      | LL_ADC_CLOCK_DIV256)    /*!< ADC CK_KER_ADC3 clock with prescaler division by 256   */
#endif /* ADC2_COMMON */
#if defined(ADC3_COMMON)
#define ADC_CLOCK_CK_KER_ADC3_DIV1                (LL_ADC_CLOCK_KER_ADC3      | LL_ADC_CLOCK_DIV1)      /*!< ADC CK_KER_ADC3 clock without prescaler                */
#define ADC_CLOCK_CK_KER_ADC3_DIV2                (LL_ADC_CLOCK_KER_ADC3      | LL_ADC_CLOCK_DIV2)      /*!< ADC CK_KER_ADC3 clock with prescaler division by 2     */
#define ADC_CLOCK_CK_KER_ADC3_DIV4                (LL_ADC_CLOCK_KER_ADC3      | LL_ADC_CLOCK_DIV4)      /*!< ADC CK_KER_ADC3 clock with prescaler division by 4     */
#define ADC_CLOCK_CK_KER_ADC3_DIV6                (LL_ADC_CLOCK_KER_ADC3      | LL_ADC_CLOCK_DIV6)      /*!< ADC CK_KER_ADC3 clock with prescaler division by 6     */
#define ADC_CLOCK_CK_KER_ADC3_DIV8                (LL_ADC_CLOCK_KER_ADC3      | LL_ADC_CLOCK_DIV8)      /*!< ADC CK_KER_ADC3 clock with prescaler division by 8     */
#define ADC_CLOCK_CK_KER_ADC3_DIV10               (LL_ADC_CLOCK_KER_ADC3      | LL_ADC_CLOCK_DIV10)     /*!< ADC CK_KER_ADC3 clock with prescaler division by 10    */
#define ADC_CLOCK_CK_KER_ADC3_DIV12               (LL_ADC_CLOCK_KER_ADC3      | LL_ADC_CLOCK_DIV12)     /*!< ADC CK_KER_ADC3 clock with prescaler division by 12    */
#define ADC_CLOCK_CK_KER_ADC3_DIV16               (LL_ADC_CLOCK_KER_ADC3      | LL_ADC_CLOCK_DIV16)     /*!< ADC CK_KER_ADC3 clock with prescaler division by 16    */
#define ADC_CLOCK_CK_KER_ADC3_DIV32               (LL_ADC_CLOCK_KER_ADC3      | LL_ADC_CLOCK_DIV32)     /*!< ADC CK_KER_ADC3 clock with prescaler division by 32    */
#define ADC_CLOCK_CK_KER_ADC3_DIV64               (LL_ADC_CLOCK_KER_ADC3      | LL_ADC_CLOCK_DIV64)     /*!< ADC CK_KER_ADC3 clock with prescaler division by 64    */
#define ADC_CLOCK_CK_KER_ADC3_DIV128              (LL_ADC_CLOCK_KER_ADC3      | LL_ADC_CLOCK_DIV128)    /*!< ADC CK_KER_ADC3 clock with prescaler division by 128   */
#define ADC_CLOCK_CK_KER_ADC3_DIV256              (LL_ADC_CLOCK_KER_ADC3      | LL_ADC_CLOCK_DIV256)    /*!< ADC CK_KER_ADC3 clock with prescaler division by 256   */
#endif /* ADC3_COMMON */
/**
  * @}
  */

/** @defgroup ADC_HAL_EC_RESOLUTION  ADC instance - Resolution
  * @{
  */
#define ADC_RESOLUTION_12B                 (LL_ADC_RESOLUTION_12B)  /*!< ADC resolution 12 bits */
#define ADC_RESOLUTION_10B                 (LL_ADC_RESOLUTION_10B)  /*!< ADC resolution 10 bits */
#define ADC_RESOLUTION_8B                  (LL_ADC_RESOLUTION_8B)   /*!< ADC resolution  8 bits */
#define ADC_RESOLUTION_6B                  (LL_ADC_RESOLUTION_6B)   /*!< ADC resolution  6 bits */
/**
  * @}
  */

/** @defgroup ADC_HAL_EC_DATA_ALIGN ADC conversion data alignment
  * @{
  */
#define ADC_DATAALIGN_RIGHT                (LL_ADC_DATA_ALIGN_RIGHT)/*!< ADC conversion data alignment: right aligned (alignment on data register LSB bit 0)*/
#define ADC_DATAALIGN_LEFT                 (LL_ADC_DATA_ALIGN_LEFT)       /*!< ADC conversion data alignment: left aligned (alignment on data register MSB bit 15)*/
/**
  * @}
  */

/** @defgroup ADC_Scan_mode ADC sequencer scan mode
  * @{
  */
#define ADC_SCAN_DISABLE         (0x00000000UL)       /*!< Scan mode disabled */
#define ADC_SCAN_ENABLE          (0x00000001UL)       /*!< Scan mode enabled  */

