zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_adc.h
/** @defgroup ADC_Private_Constants ADC Private Constants
  * @{
  */

/* Combination of all post-conversion flags bits: EOC/EOS, OVR, AWD */
#define ADC_FLAG_POSTCONV_ALL    (ADC_FLAG_AWD | ADC_FLAG_OVR | ADC_FLAG_EOS | ADC_FLAG_EOC)
/**
  * @}
  */

/* Combination of all CHSELR bits: SQ2...SQ8 */
#define ADC_CHSELR_SQ2_TO_SQ8           (ADC_CHSELR_SQ2 | ADC_CHSELR_SQ3 | ADC_CHSELR_SQ4 | ADC_CHSELR_SQ5\
                                         | ADC_CHSELR_SQ6 | ADC_CHSELR_SQ7 | ADC_CHSELR_SQ8)
/**
  * @}
  */

/** @defgroup ADC_regular_external_trigger_source ADC group regular trigger source
  * @{
  */
#define ADC_SOFTWARE_START               (LL_ADC_REG_TRIG_SOFTWARE)              /*!< ADC group regular conversion trigger internal: SW start. */
#define ADC_EXTERNALTRIG_T1_TRGO         (LL_ADC_REG_TRIG_EXT_TIM1_TRGO)         /*!< ADC group regular conversion trigger from external peripheral: TIM1  TRGO event.  Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T1_TRGO2        (LL_ADC_REG_TRIG_EXT_TIM1_TRGO2)        /*!< ADC group regular conversion trigger from external peripheral: TIM1  TRGO2 event. Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T8_TRGO         (LL_ADC_REG_TRIG_EXT_TIM8_TRGO)         /*!< ADC group regular conversion trigger from external peripheral: TIM8  TRGO event.  Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T8_TRGO2        (LL_ADC_REG_TRIG_EXT_TIM8_TRGO2)        /*!< ADC group regular conversion trigger from external peripheral: TIM8  TRGO2 event. Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T20_TRGO        (LL_ADC_REG_TRIG_EXT_TIM20_TRGO)        /*!< ADC group regular conversion trigger from external peripheral: TIM20 TRGO event.  Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T20_TRGO2       (LL_ADC_REG_TRIG_EXT_TIM20_TRGO2)       /*!< ADC group regular conversion trigger from external peripheral: TIM20 TRGO2 event. Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T2_TRGO         (LL_ADC_REG_TRIG_EXT_TIM2_TRGO)         /*!< ADC group regular conversion trigger from external peripheral: TIM2  TRGO event.  Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T3_TRGO         (LL_ADC_REG_TRIG_EXT_TIM3_TRGO)         /*!< ADC group regular conversion trigger from external peripheral: TIM3  TRGO event.  Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T4_TRGO         (LL_ADC_REG_TRIG_EXT_TIM4_TRGO)         /*!< ADC group regular conversion trigger from external peripheral: TIM4  TRGO event.  Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T5_TRGO         (LL_ADC_REG_TRIG_EXT_TIM5_TRGO)         /*!< ADC group regular conversion trigger from external peripheral: TIM5  TRGO event.  Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T6_TRGO         (LL_ADC_REG_TRIG_EXT_TIM6_TRGO)         /*!< ADC group regular conversion trigger from external peripheral: TIM6  TRGO event.  Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T15_TRGO_ADC12  (LL_ADC_REG_TRIG_EXT_TIM15_TRGO_ADC12)  /*!< ADC group regular conversion trigger from external peripheral: TIM15 TRGO event.  Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T1_CC1          (LL_ADC_REG_TRIG_EXT_TIM1_CC1)          /*!< ADC group regular conversion trigger from external peripheral: TIM1  channel 1 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T1_CC2          (LL_ADC_REG_TRIG_EXT_TIM1_CC2)          /*!< ADC group regular conversion trigger from external peripheral: TIM1  channel 2 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T1_CC3          (LL_ADC_REG_TRIG_EXT_TIM1_CC3)          /*!< ADC group regular conversion trigger from external peripheral: TIM1  channel 3 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T20_CC1_ADC12   (LL_ADC_REG_TRIG_EXT_TIM20_CC1_ADC12)   /*!< ADC group regular conversion trigger from external peripheral: TIM20 channel 1 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T20_CC2         (LL_ADC_REG_TRIG_EXT_TIM20_CC2)         /*!< ADC group regular conversion trigger from external peripheral: TIM20 channel 2 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T20_CC3         (LL_ADC_REG_TRIG_EXT_TIM20_CC3)         /*!< ADC group regular conversion trigger from external peripheral: TIM20 channel 3 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T2_CC2          (LL_ADC_REG_TRIG_EXT_TIM2_CC2)          /*!< ADC group regular conversion trigger from external peripheral: TIM2  channel 2 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T3_CC4          (LL_ADC_REG_TRIG_EXT_TIM3_CC4)          /*!< ADC group regular conversion trigger from external peripheral: TIM3  channel 4 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T4_CC4          (LL_ADC_REG_TRIG_EXT_TIM4_CC4)          /*!< ADC group regular conversion trigger from external peripheral: TIM4  channel 4 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T5_CC1          (LL_ADC_REG_TRIG_EXT_TIM5_CC1)          /*!< ADC group regular conversion trigger from external peripheral: TIM5  channel 1 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_T12_CC1         (LL_ADC_REG_TRIG_EXT_TIM12_CC1)         /*!< ADC group regular conversion trigger from external peripheral: TIM12 channel 1 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_EXT_IT11        (LL_ADC_REG_TRIG_EXT_EXTI_LINE11)       /*!< ADC group regular conversion trigger from external peripheral: external interrupt line 11. Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_LPTIM1_CH1      (LL_ADC_REG_TRIG_EXT_LPTIM1_CH1)        /*!< ADC group regular conversion trigger from external peripheral: LPTIM1 channel 1 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_LPTIM2_CH1      (LL_ADC_REG_TRIG_EXT_LPTIM2_CH1)        /*!< ADC group regular conversion trigger from external peripheral: LPTIM2 channel 2 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_LPTIM3_CH1      (LL_ADC_REG_TRIG_EXT_LPTIM3_CH1)        /*!< ADC group regular conversion trigger from external peripheral: LPTIM3 channel 3 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_LPTIM4_CH1      (LL_ADC_REG_TRIG_EXT_LPTIM4_CH1)        /*!< ADC group regular conversion trigger from external peripheral: LPTIM4 channel 4 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIG_LPTIM5_OUT      (LL_ADC_REG_TRIG_EXT_LPTIM5_OUT)        /*!< ADC group regular conversion trigger from external peripheral: LPTIM5 channel 5 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */

