zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_adc.h
/** @defgroup ADC_HAL_EC_OVS_SCOPE_REG  Oversampling - Oversampling scope for ADC group regular
  * @{
  */
#define ADC_REGOVERSAMPLING_CONTINUED_MODE    (LL_ADC_OVS_GRP_REGULAR_CONTINUED) /*!< Oversampling buffer maintained during injection sequence */
#define ADC_REGOVERSAMPLING_RESUMED_MODE      (LL_ADC_OVS_GRP_REGULAR_RESUMED)   /*!< Oversampling buffer zeroed during injection sequence     */
/**
  * @}
  */

/** @defgroup ADC_Event_type ADC Event type
  * @{
  */
#define ADC_EOSMP_EVENT          (ADC_FLAG_EOSMP) /*!< ADC End of Sampling event */
#define ADC_AWD1_EVENT           (ADC_FLAG_AWD1)  /*!< ADC Analog watchdog 1 event (main analog watchdog, present on all STM32 series) */
#define ADC_AWD2_EVENT           (ADC_FLAG_AWD2)  /*!< ADC Analog watchdog 2 event (additional analog watchdog, not present on all STM32 series) */
#define ADC_AWD3_EVENT           (ADC_FLAG_AWD3)  /*!< ADC Analog watchdog 3 event (additional analog watchdog, not present on all STM32 series) */
#define ADC_OVR_EVENT            (ADC_FLAG_OVR)   /*!< ADC overrun event */
/**
  * @}
  */
#define ADC_AWD_EVENT            ADC_AWD1_EVENT      /*!< ADC Analog watchdog 1 event: Naming for compatibility with other STM32 devices having only one analog watchdog */

/** @defgroup ADC_interrupts_definition ADC interrupts definition
  * @{
  */
#define ADC_IT_RDY           ADC_IER_ADRDYIE    /*!< ADC Ready interrupt source */
#define ADC_IT_EOSMP         ADC_IER_EOSMPIE    /*!< ADC End of sampling interrupt source */
#define ADC_IT_EOC           ADC_IER_EOCIE      /*!< ADC End of regular conversion interrupt source */
#define ADC_IT_EOS           ADC_IER_EOSIE      /*!< ADC End of regular sequence of conversions interrupt source */
#define ADC_IT_OVR           ADC_IER_OVRIE      /*!< ADC overrun interrupt source */
#define ADC_IT_JEOC          ADC_IER_JEOCIE     /*!< ADC End of injected conversion interrupt source */
#define ADC_IT_JEOS          ADC_IER_JEOSIE     /*!< ADC End of injected sequence of conversions interrupt source */
#define ADC_IT_AWD1          ADC_IER_AWD1IE     /*!< ADC Analog watchdog 1 interrupt source (main analog watchdog) */
#define ADC_IT_AWD2          ADC_IER_AWD2IE     /*!< ADC Analog watchdog 2 interrupt source (additional analog watchdog) */
#define ADC_IT_AWD3          ADC_IER_AWD3IE     /*!< ADC Analog watchdog 3 interrupt source (additional analog watchdog) */

#define ADC_IT_AWD           ADC_IT_AWD1        /*!< ADC Analog watchdog 1 interrupt source: naming for compatibility with other STM32 devices having only one analog watchdog */

/**
  * @}
  */

/** @defgroup ADC_flags_definition ADC flags definition
  * @{
  */
#define ADC_FLAG_RDY           ADC_ISR_ADRDY    /*!< ADC Ready flag */
#define ADC_FLAG_EOSMP         ADC_ISR_EOSMP    /*!< ADC End of Sampling flag */
#define ADC_FLAG_EOC           ADC_ISR_EOC      /*!< ADC End of Regular Conversion flag */
#define ADC_FLAG_EOS           ADC_ISR_EOS      /*!< ADC End of Regular sequence of Conversions flag */
#define ADC_FLAG_OVR           ADC_ISR_OVR      /*!< ADC overrun flag */
#define ADC_FLAG_JEOC          ADC_ISR_JEOC     /*!< ADC End of Injected Conversion flag */
#define ADC_FLAG_JEOS          ADC_ISR_JEOS     /*!< ADC End of Injected sequence of Conversions flag */
#define ADC_FLAG_AWD1          ADC_ISR_AWD1     /*!< ADC Analog watchdog 1 flag (main analog watchdog) */
#define ADC_FLAG_AWD2          ADC_ISR_AWD2     /*!< ADC Analog watchdog 2 flag (additional analog watchdog) */
#define ADC_FLAG_AWD3          ADC_ISR_AWD3     /*!< ADC Analog watchdog 3 flag (additional analog watchdog) */

/**
  * @}
  */

/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/

/** @defgroup ADC_Private_Macros ADC Private Macros
  * @{
  */
/* Macro reserved for internal HAL driver usage, not intended to be used in   */
/* code of final user.                                                        */

/**
  * @brief Verify the ADC data conversion setting.
  * @param DATA : programmed DATA conversion mode.
  * @retval SET (DATA is a valid value) or RESET (DATA is invalid)
  */
#define IS_ADC_CONVERSIONDATAMGT(DATA)                                         \
  ((((DATA) == ADC_CONVERSIONDATA_DR))          || \
   (((DATA) == ADC_CONVERSIONDATA_MDF))       || \
   (((DATA) == ADC_CONVERSIONDATA_DMA_ONESHOT)) || \
   (((DATA) == ADC_CONVERSIONDATA_DMA_CIRCULAR)))

/**
  * @brief Return resolution bits in CFGR register RES[1:0] field.
  * @param __HANDLE__ ADC handle
  * @retval Value of bitfield RES in CFGR register.
  */
#define ADC_GET_RESOLUTION(__HANDLE__)                                         \
  (LL_ADC_GetResolution((__HANDLE__)->Instance))

/**
  * @brief Clear ADC error code (set it to no error code "HAL_ADC_ERROR_NONE").
  * @param __HANDLE__ ADC handle
  * @retval None
  */
#define ADC_CLEAR_ERRORCODE(__HANDLE__) ((__HANDLE__)->ErrorCode = HAL_ADC_ERROR_NONE)

/**
  * @brief Enable the ADC peripheral
  * @param __HANDLE__: ADC handle
  * @retval None
  */
#define __HAL_ADC_ENABLE(__HANDLE__) ((__HANDLE__)->Instance->CR |= ADC_CR_ADEN)

/**
  * @brief Verification of hardware constraints before ADC can be enabled
  * @param __HANDLE__: ADC handle
  * @retval SET (ADC can be enabled) or RESET (ADC cannot be enabled)
  */
#define ADC_ENABLING_CONDITIONS(__HANDLE__)                                    \
  (( HAL_IS_BIT_CLR((__HANDLE__)->Instance->CR                        ,        \
                    (ADC_CR_ADCAL    | ADC_CR_JADSTP | ADC_CR_ADSTP |          \
                     ADC_CR_JADSTART |ADC_CR_ADSTART | ADC_CR_ADDIS |          \
                     ADC_CR_ADEN                                     ) )       \
   ) ? SET : RESET)

/**
  * @brief Disable the ADC peripheral
  * @param __HANDLE__: ADC handle
  * @retval None
  */
#define __HAL_ADC_DISABLE(__HANDLE__)                                          \
  do{                                                                          \
    (__HANDLE__)->Instance->CR |= ADC_CR_ADDIS;                           \
    __HAL_ADC_CLEAR_FLAG((__HANDLE__), (ADC_FLAG_EOSMP | ADC_FLAG_RDY)); \
  } while(0)

/**
  * @brief Verification of hardware constraints before ADC can be disabled
  * @param __HANDLE__: ADC handle
  * @retval SET (ADC can be disabled) or RESET (ADC cannot be disabled)
  */
#define ADC_DISABLING_CONDITIONS(__HANDLE__)                                   \
  (( ( ((__HANDLE__)->Instance->CR) &                                     \
       (ADC_CR_JADSTART | ADC_CR_ADSTART | ADC_CR_ADEN)) == ADC_CR_ADEN   \
   ) ? SET : RESET)

/**
  * @brief Verification of ADC state: enabled or disabled.
  * @param __HANDLE__ ADC handle
  * @retval SET (ADC enabled) or RESET (ADC disabled)
  */
#define ADC_IS_ENABLE(__HANDLE__)                                                      \
  (( ((((__HANDLE__)->Instance->CR) & (ADC_CR_ADEN | ADC_CR_ADDIS)) == ADC_CR_ADEN) && \
     ((((__HANDLE__)->Instance->ISR) & ADC_FLAG_RDY) == ADC_FLAG_RDY)                  \
   ) ? SET : RESET)

/**
  * @brief Check if conversion is on going on regular group.
  * @param __HANDLE__ ADC handle
  * @retval Value "0" (no conversion is on going) or value "1" (conversion is on going)
  */
#define ADC_IS_CONVERSION_ONGOING_REGULAR(__HANDLE__)                          \
  (LL_ADC_REG_IsConversionOngoing((__HANDLE__)->Instance))


/**
  * @brief Simultaneously clear and set specific bits of the handle State.
  * @note  ADC_STATE_CLR_SET() macro is merely aliased to generic macro MODIFY_REG(),
  *        the first parameter is the ADC handle State, the second parameter is the
  *        bit field to clear, the third and last parameter is the bit field to set.
  * @retval None
  */
#define ADC_STATE_CLR_SET MODIFY_REG

/**
  * @brief Verify that a given value is aligned with the ADC resolution range.
  * @param __RESOLUTION__ ADC resolution (12, 10, 8 or 6 bits).
  * @param __ADC_VALUE__ value checked against the resolution.
  * @retval SET (__ADC_VALUE__ in line with __RESOLUTION__) or RESET (__ADC_VALUE__ not in line with __RESOLUTION__)
  */
#define IS_ADC_RANGE(__RESOLUTION__, __ADC_VALUE__) \
  ((__ADC_VALUE__) <= __LL_ADC_DIGITAL_SCALE(__RESOLUTION__))

/**
  * @brief Verify the length of the scheduled regular conversions group.
  * @param __LENGTH__ number of programmed conversions.
  * @retval SET (__LENGTH__ is within the maximum number of possible programmable regular conversions)
  *         or RESET (__LENGTH__ is null or too large)
  */
#define IS_ADC_REGULAR_NB_CONV(__LENGTH__) (((__LENGTH__) >= (1UL)) && ((__LENGTH__) <= (16UL)))


/**
  * @brief Verify the number of scheduled regular conversions in discontinuous mode.
  * @param NUMBER number of scheduled regular conversions in discontinuous mode.
  * @retval SET (NUMBER is within the maximum number of regular conversions in discontinuous mode)
  *         or RESET (NUMBER is null or too large)
  */
#define IS_ADC_REGULAR_DISCONT_NUMBER(NUMBER) (((NUMBER) >= (1UL)) && ((NUMBER) <= (8UL)))

/**
  * @brief Verify the ADC clock setting.
  * @param __ADC_CLOCK__ programmed ADC clock.
  * @retval SET (__ADC_CLOCK__ is a valid value) or RESET (__ADC_CLOCK__ is invalid)
  */
#if defined (ADC12_COMMON)
#define IS_ADC12_CLOCKPRESCALER(__ADC_CLOCK__) (((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV1)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV2)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV4)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV6)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV8)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV10)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV12)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV16)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV32)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV64)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV128)   || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV256)   || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV1)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV2)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV4)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV6)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV8)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV10)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV12)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV16)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV32)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV64)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV128)   || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV256) )
#endif /* ADC12_COMMON */

#if defined (ADC1_COMMON)
#define IS_ADC1_CLOCKPRESCALER(__ADC_CLOCK__)  (((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC1_DIV1)       || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC1_DIV2)       || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC1_DIV4)       || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC1_DIV6)       || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC1_DIV8)       || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC1_DIV10)      || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC1_DIV12)      || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC1_DIV16)      || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC1_DIV32)      || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC1_DIV64)      || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC1_DIV128)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC1_DIV256)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV1)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV2)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV4)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV6)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV8)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV10)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV12)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV16)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV32)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV64)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV128)   || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV256) )
#endif /* ADC1_COMMON */

