zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_adc.h
#if defined (ADC2_COMMON)
#define IS_ADC2_CLOCKPRESCALER(__ADC_CLOCK__)  (((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC2_DIV1)       || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC2_DIV2)       || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC2_DIV4)       || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC2_DIV6)       || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC2_DIV8)       || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC2_DIV10)      || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC2_DIV12)      || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC2_DIV16)      || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC2_DIV32)      || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC2_DIV64)      || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC2_DIV128)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC2_DIV256)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV1)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV2)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV4)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV6)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV8)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV10)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV12)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV16)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV32)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV64)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV128)   || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV256) )
#endif /* ADC2_COMMON */

#if defined(ADC3_COMMON)
#define IS_ADC3_CLOCKPRESCALER(__ADC_CLOCK__)  (((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV1)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV2)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV4)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV6)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV8)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV10)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV12)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV16)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV32)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV64)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV128)   || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC12_DIV256)   || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC3_DIV1)      || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC3_DIV2)      || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC3_DIV4)      || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC3_DIV6)      || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC3_DIV8)      || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC3_DIV10)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC3_DIV12)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC3_DIV16)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC3_DIV32)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC3_DIV64)     || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC3_DIV128)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_KER_ADC3_DIV256)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV1)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV2)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV4)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV6)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV8)    || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV10)   || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV12)   || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV16)   || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV32)   || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV64)   || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV128)  || \
                                                ((__ADC_CLOCK__) == ADC_CLOCK_CK_ICN_LS_MCU_DIV256) )
#endif /* ADC3_COMMON */

