zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_adc.h
#if defined (ADC12_COMMON) && defined(ADC3_COMMON)
#define IS_ADC_CLOCKPRESCALER(__INSTANCE__, __ADC_CLOCK__)                 \
  (((     ((__INSTANCE__) == ADC1)||((__INSTANCE__) == ADC2))  && IS_ADC12_CLOCKPRESCALER(__ADC_CLOCK__))  \
   ||                                                       \
   ((((__INSTANCE__) == ADC3) && IS_ADC3_CLOCKPRESCALER(__ADC_CLOCK__))))
#endif /* defined (ADC12_COMMON) && defined(ADC3_COMMON) */

#if defined (ADC1_COMMON) && defined(ADC2_COMMON)
#define IS_ADC_CLOCKPRESCALER(__INSTANCE__, __ADC_CLOCK__)                 \
  (((     ((__INSTANCE__) == ADC1))  && IS_ADC1_CLOCKPRESCALER(__ADC_CLOCK__))  \
   ||                                                       \
   ((((__INSTANCE__) == ADC2) && IS_ADC2_CLOCKPRESCALER(__ADC_CLOCK__))))
#endif /* defined (ADC1_COMMON) && defined(ADC2_COMMON) */

/**
  * @brief Verify the ADC resolution setting.
  * @param __RESOLUTION__ programmed ADC resolution.
  * @retval SET (__RESOLUTION__ is a valid value) or RESET (__RESOLUTION__ is invalid)
  */
#define IS_ADC_RESOLUTION(__RESOLUTION__) (((__RESOLUTION__) == ADC_RESOLUTION_12B) || \
                                           ((__RESOLUTION__) == ADC_RESOLUTION_10B) || \
                                           ((__RESOLUTION__) == ADC_RESOLUTION_8B)  || \
                                           ((__RESOLUTION__) == ADC_RESOLUTION_6B)    )

/**
  * @brief Verify the ADC resolution setting when limited to 6 or 8 bits.
  * @param __RESOLUTION__ programmed ADC resolution when limited to 6 or 8 bits.
  * @retval SET (__RESOLUTION__ is a valid value) or RESET (__RESOLUTION__ is invalid)
  */
#define IS_ADC_RESOLUTION_8_6_BITS(__RESOLUTION__) (((__RESOLUTION__) == ADC_RESOLUTION_8B) || \
                                                    ((__RESOLUTION__) == ADC_RESOLUTION_6B)   )

/**
  * @brief Verify the ADC gain compensation.
  * @param __GAIN_COMPENSATION__ programmed ADC gain compensation coefficient.
  * @retval SET (__GAIN_COMPENSATION__ is a valid value) or RESET (__GAIN_COMPENSATION__ is invalid)
  */
#define IS_ADC_GAIN_COMPENSATION(__GAIN_COMPENSATION__) ((__GAIN_COMPENSATION__) <= 0x3FFFUL)

/**
  * @brief Verify the ADC scan mode.
  * @param __SCAN_MODE__ programmed ADC scan mode.
  * @retval SET (__SCAN_MODE__ is valid) or RESET (__SCAN_MODE__ is invalid)
  */
#define IS_ADC_SCAN_MODE(__SCAN_MODE__) (((__SCAN_MODE__) == ADC_SCAN_DISABLE) || \
                                         ((__SCAN_MODE__) == ADC_SCAN_ENABLE)    )

/**
  * @brief Verify the ADC edge trigger setting for regular group.
  * @param __EDGE__ programmed ADC edge trigger setting.
  * @retval SET (__EDGE__ is a valid value) or RESET (__EDGE__ is invalid)
  */
#define IS_ADC_EXTTRIG_EDGE(__EDGE__) (((__EDGE__) == ADC_EXTERNALTRIGCONVEDGE_NONE)         || \
                                       ((__EDGE__) == ADC_EXTERNALTRIGCONVEDGE_RISING)       || \
                                       ((__EDGE__) == ADC_EXTERNALTRIGCONVEDGE_FALLING)      || \
                                       ((__EDGE__) == ADC_EXTERNALTRIGCONVEDGE_RISINGFALLING)  )

/**
  * @brief Verify the ADC regular conversions external trigger.
  * @param __REG_TRIG_SOURCE__ programmed ADC regular conversions external trigger.
  * @retval SET (__REG_TRIG_SOURCE__ is a valid value) or RESET (__REG_TRIG_SOURCE__ is invalid)
  */
#define IS_ADC_EXTTRIG_ADC12(__REG_TRIG_SOURCE__)                         \
  (      ((__REG_TRIG_SOURCE__) == ADC_SOFTWARE_START)                    \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T1_TRGO)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T1_TRGO2)             \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T8_TRGO)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T8_TRGO2)             \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T20_TRGO)             \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T20_TRGO2)            \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T2_TRGO)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T3_TRGO)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T4_TRGO)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T5_TRGO)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T6_TRGO)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T15_TRGO_ADC12)       \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T1_CC1)               \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T1_CC2)               \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T1_CC3)               \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T20_CC1_ADC12)        \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T20_CC2)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T20_CC3)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T2_CC2)               \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T3_CC4)               \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T4_CC4)               \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T5_CC1)               \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T12_CC1)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_EXT_IT11)             \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_LPTIM1_CH1)           \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_LPTIM2_CH1)           \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_LPTIM3_CH1)           \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_LPTIM5_OUT)           \
  )

/**
  * @brief Verify the ADC regular conversions external trigger.
  * @param __REG_TRIG_SOURCE__ programmed ADC regular conversions external trigger.
  * @retval SET (__REG_TRIG_SOURCE__ is a valid value) or RESET (__REG_TRIG_SOURCE__ is invalid)
  */
#define IS_ADC_EXTTRIG_ADC3(__REG_TRIG_SOURCE__)                          \
  (      ((__REG_TRIG_SOURCE__) == ADC_SOFTWARE_START)                    \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T1_TRGO)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T1_TRGO2)             \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T8_TRGO)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T8_TRGO2)             \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T20_TRGO)             \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T20_TRGO2)            \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T2_TRGO)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T3_TRGO)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T4_TRGO)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T5_TRGO)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T6_TRGO)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T7_TRGO)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T15_TRGO_ADC3)        \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T17_CC1)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T1_CC3)               \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T8_CC1)               \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T20_CC1_ADC3)         \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T2_CC1)               \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T2_CC3)               \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T3_CC1)               \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T4_CC1)               \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T5_CC3)               \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_T12_CC1)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_EXT_IT2)              \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_LPTIM1_CH1)           \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_LPTIM2_CH1)           \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_LPTIM3_CH1)           \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_LPTIM4_CH1)           \
         || ((__REG_TRIG_SOURCE__) == ADC_EXTERNALTRIG_LPTIM5_OUT)           \
  )

/**
  * @brief Verify the ADC regular conversions external trigger.
  * @param __ADC_INSTANCE__ ADC instance
  * @param __REG_TRIG_SOURCE__ programmed ADC regular conversions external trigger.
  * @retval SET (__REG_TRIG_SOURCE__ is a valid value) or RESET (__REG_TRIG_SOURCE__ is invalid)
  */
#define IS_ADC_EXTTRIG(__ADC_INSTANCE__, __REG_TRIG_SOURCE__)               \
  ((((__ADC_INSTANCE__) == ADC1) || ((__ADC_INSTANCE__) == ADC2))           \
   ? IS_ADC_EXTTRIG_ADC12(__REG_TRIG_SOURCE__)                             \
   :                                                                     \
   IS_ADC_EXTTRIG_ADC3(__REG_TRIG_SOURCE__)                              \
  )


/**
  * @brief Verify the ADC regular conversions external trigger.
  * @param __SAMPLINGMODE__ programmed ADC regular conversions external trigger.
  * @retval SET (__SAMPLINGMODE__ is a valid value) or RESET (__SAMPLINGMODE__ is invalid)
  */
#define IS_ADC_SAMPLINGMODE(__SAMPLINGMODE__) (((__SAMPLINGMODE__) == ADC_SAMPLING_MODE_NORMAL)          || \
                                               ((__SAMPLINGMODE__) == ADC_SAMPLING_MODE_BULB)            || \
                                               ((__SAMPLINGMODE__) == ADC_SAMPLING_MODE_TRIGGER_CONTROLED)  )

/**
  * @brief Verify the ADC regular conversions check for converted data availability.
  * @param __EOC_SELECTION__ converted data availability check.
  * @retval SET (__EOC_SELECTION__ is a valid value) or RESET (__EOC_SELECTION__ is invalid)
  */
#define IS_ADC_EOC_SELECTION(__EOC_SELECTION__) (((__EOC_SELECTION__) == ADC_EOC_SINGLE_CONV)    || \
                                                 ((__EOC_SELECTION__) == ADC_EOC_SEQ_CONV)  )

/**
  * @brief Verify the ADC regular conversions overrun handling.
  * @param __OVR__ ADC regular conversions overrun handling.
  * @retval SET (__OVR__ is a valid value) or RESET (__OVR__ is invalid)
  */
#define IS_ADC_OVERRUN(__OVR__) (((__OVR__) == ADC_OVR_DATA_PRESERVED)  || \
                                 ((__OVR__) == ADC_OVR_DATA_OVERWRITTEN)  )

/**
  * @brief Verify the ADC conversions sampling time.
  * @param __SAMPLING_TIME__ ADC conversions sampling time.
  * @retval SET (__SAMPLING_TIME__ is a valid value) or RESET (__SAMPLING_TIME__ is invalid)
  */
#define IS_ADC_SAMPLING_TIME(__SAMPLING_TIME__) (((__SAMPLING_TIME__) == ADC_SAMPLETIME_2CYCLES_5)   || \
                                                 ((__SAMPLING_TIME__) == ADC_SAMPLETIME_3CYCLES_5)   || \
                                                 ((__SAMPLING_TIME__) == ADC_SAMPLETIME_7CYCLES_5)   || \
                                                 ((__SAMPLING_TIME__) == ADC_SAMPLETIME_12CYCLES_5)  || \
                                                 ((__SAMPLING_TIME__) == ADC_SAMPLETIME_24CYCLES_5)  || \
                                                 ((__SAMPLING_TIME__) == ADC_SAMPLETIME_47CYCLES_5)  || \
                                                 ((__SAMPLING_TIME__) == ADC_SAMPLETIME_247CYCLES_5) || \
                                                 ((__SAMPLING_TIME__) == ADC_SAMPLETIME_1501CYCLES_5)   )

/**
  * @brief Verify the ADC regular channel setting.
  * @param  __CHANNEL__ programmed ADC regular channel.
  * @retval SET (__CHANNEL__ is valid) or RESET (__CHANNEL__ is invalid)
  */
#define IS_ADC_REGULAR_RANK(__CHANNEL__) (((__CHANNEL__) == ADC_REGULAR_RANK_1 ) || \
                                          ((__CHANNEL__) == ADC_REGULAR_RANK_2 ) || \
                                          ((__CHANNEL__) == ADC_REGULAR_RANK_3 ) || \
                                          ((__CHANNEL__) == ADC_REGULAR_RANK_4 ) || \
                                          ((__CHANNEL__) == ADC_REGULAR_RANK_5 ) || \
                                          ((__CHANNEL__) == ADC_REGULAR_RANK_6 ) || \
                                          ((__CHANNEL__) == ADC_REGULAR_RANK_7 ) || \
                                          ((__CHANNEL__) == ADC_REGULAR_RANK_8 ) || \
                                          ((__CHANNEL__) == ADC_REGULAR_RANK_9 ) || \
                                          ((__CHANNEL__) == ADC_REGULAR_RANK_10) || \
                                          ((__CHANNEL__) == ADC_REGULAR_RANK_11) || \
                                          ((__CHANNEL__) == ADC_REGULAR_RANK_12) || \
                                          ((__CHANNEL__) == ADC_REGULAR_RANK_13) || \
                                          ((__CHANNEL__) == ADC_REGULAR_RANK_14) || \
                                          ((__CHANNEL__) == ADC_REGULAR_RANK_15) || \
                                          ((__CHANNEL__) == ADC_REGULAR_RANK_16)   )

#define IS_ADC_TRIGGER_FREQ(TRIGGER_FREQ) (((TRIGGER_FREQ) == LL_ADC_TRIGGER_FREQ_HIGH) || \
                                           ((TRIGGER_FREQ) == LL_ADC_TRIGGER_FREQ_LOW)    )
/**
  * @}
  */


/* Private constants ---------------------------------------------------------*/

